In [1]:
import mysql.connector
from mysql.connector import Error
import time

In [2]:
# Establishing the connection to the MySQL server
def create_connection(db_name="travel_1"):
    connection = None
    try:
        connection = mysql.connector.connect(
            host="localhost",  # Update with your host
            user="root",  # Update with your MySQL username
            password="strong_password",  # Update with your MySQL password
            database=db_name  # Update with your database name
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")
    
    return connection

# Create tables according to the ER diagram
def create_tables(connection):
    cursor = connection.cursor()

    # Create Users table
    cursor.execute("""
    CREATE TABLE IF NOT EXISTS Users (
        user_id INT AUTO_INCREMENT PRIMARY KEY,
        username VARCHAR(50) NOT NULL,
        email VARCHAR(100) NOT NULL,
        password VARCHAR(255) NOT NULL,
        contact_info VARCHAR(150)
    )
    """)

    # Create Flight table
    cursor.execute("""
    CREATE TABLE IF NOT EXISTS Flight (
        flight_id INT AUTO_INCREMENT PRIMARY KEY,
        airline VARCHAR(50),
        destination VARCHAR(50),
        departure_time DATETIME,
        arrival_time DATETIME,
        price DECIMAL(10, 2)
    )
    """)

    # Create Hotel table
    cursor.execute("""
    CREATE TABLE IF NOT EXISTS Hotel (
        hotel_id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(50),
        location VARCHAR(50),
        rooms_available INT,
        price_per_night DECIMAL(10, 2)
    )
    """)

    # Create Car table with car_number column
    cursor.execute("""
    CREATE TABLE IF NOT EXISTS Car (
        car_id INT AUTO_INCREMENT PRIMARY KEY,
        car_number VARCHAR(50) NOT NULL,
        model VARCHAR(100),
        type VARCHAR(50),
        location VARCHAR(100),
        rental_price DECIMAL(10, 2)
    )
    """)

    # Create Booking table
    cursor.execute("""
    CREATE TABLE IF NOT EXISTS Booking (
        booking_id INT AUTO_INCREMENT PRIMARY KEY,
        user_id INT,
        flight_id INT,
        hotel_id INT,
        car_id INT,
        booking_date DATETIME,
        total_cost DECIMAL(10, 2),
        FOREIGN KEY (user_id) REFERENCES Users(user_id),
        FOREIGN KEY (flight_id) REFERENCES Flight(flight_id),
        FOREIGN KEY (hotel_id) REFERENCES Hotel(hotel_id),
        FOREIGN KEY (car_id) REFERENCES Car(car_id)
    )
    """)

    connection.commit()
    print("Tables created successfully")


# Insert sample data
def insert_sample_data(connection):
    cursor = connection.cursor()

    # Insert data into Users
    users = [
        ("JohnDoe", "john@example.com", "password123", "1234567890"),
        ("JaneSmith", "jane@example.com", "password456", "0987654321"),
        ("AliceJohnson", "alice@example.com", "password789", "1122334455"),
        ("BobBrown", "bob@example.com", "password987", "2233445566"),
        ("ChrisWhite", "chris@example.com", "password654", "3344556677"),
        ("DianaGreen", "diana@example.com", "password321", "4455667788"),
        ("EveBlue", "eve@example.com", "passwordabc", "5566778899"),
        ("FrankYellow", "frank@example.com", "passworddef", "6677889900"),
        ("GracePink", "grace@example.com", "passwordghi", "7788990011"),
        ("HankBlack", "hank@example.com", "passwordjkl", "8899001122")
    ]
    cursor.executemany("""
    INSERT INTO Users (username, email, password, contact_info) 
    VALUES (%s, %s, %s, %s)
    """, users)

    # Insert data into Flight
    flights = [
        ("Airline A", "New York", "2024-12-01 08:00:00", "2024-12-01 14:00:00", 500.00),
        ("Airline B", "London", "2024-12-05 10:00:00", "2024-12-05 16:00:00", 750.00),
        ("Airline C", "Paris", "2023-05-20 09:00:00", "2023-05-20 13:00:00", 600.00),
        ("Airline D", "Tokyo", "2023-09-12 14:00:00", "2023-09-12 22:00:00", 800.00),
        ("Airline E", "Sydney", "2022-03-10 07:00:00", "2022-03-10 19:00:00", 1200.00),
        ("Airline F", "Berlin", "2022-07-01 12:00:00", "2022-07-01 17:00:00", 900.00)
    ]
    cursor.executemany("""
    INSERT INTO Flight (airline, destination, departure_time, arrival_time, price) 
    VALUES (%s, %s, %s, %s, %s)
    """, flights)

    # Insert data into Hotel
    hotels = [
        ("Hotel Plaza", "New York", 10, 200.00),
        ("Grand Hotel", "London", 5, 300.00),
        ("Hilton Paris", "Paris", 20, 250.00),
        ("Tokyo Inn", "Tokyo", 15, 220.00),
        ("Sydney Lodge", "Sydney", 7, 350.00),
        ("Berlin Suites", "Berlin", 12, 400.00)
    ]
    cursor.executemany("""
    INSERT INTO Hotel (name, location, rooms_available, price_per_night) 
    VALUES (%s, %s, %s, %s)
    """, hotels)

    # Insert data into Car
    cars = [
        ("Toyota Corolla", "AB1234","Sedan", "New York", 50.00),
        ("BMW X5", "AB1233","SUV", "London", 100.00),
        ("Audi A3", "AB1232","Sedan", "Paris", 70.00),
        ("Nissan Rogue", "AB1231","SUV", "Tokyo", 80.00),
        ("Ford Escape", "AB1230","SUV", "Sydney", 90.00),
        ("Mercedes-Benz C-Class", "AB1229","Sedan", "Berlin", 120.00)
    ]
    cursor.executemany("""
    INSERT INTO Car (model, car_number, type, location, rental_price) 
    VALUES (%s, %s, %s, %s, %s)
    """, cars)

    # Insert data into Booking
    bookings = [
        # Bookings for 2022
        (1, 5, 5, 5, "2022-03-10 07:00:00", 1550.00),  # Sydney + Ford Escape
        (2, 6, 6, 6, "2022-07-01 12:00:00", 1300.00),  # Berlin + Mercedes-Benz
        (3, 3, 1, 1, "2022-04-10 09:00:00", 980.00),   # New York + Toyota Corolla
        (4, 4, 2, 2, "2022-06-18 12:00:00", 1100.00),  # London + BMW X5
        (5, 1, 3, 3, "2022-08-25 10:00:00", 890.00),   # Paris + Audi A3
        (6, 2, 4, 4, "2022-11-10 15:00:00", 980.00),   # Tokyo + Nissan Rogue

        # Bookings for 2023
        (7, 3, 1, 1, "2023-05-20 09:00:00", 920.00),   # New York + Toyota Corolla
        (8, 4, 2, 2, "2023-08-15 12:00:00", 1150.00),  # London + BMW X5
        (9, 5, 3, 3, "2023-04-18 10:00:00", 990.00),   # Paris + Audi A3
        (10, 6, 4, 4, "2023-12-20 15:00:00", 1420.00), # Tokyo + Nissan Rogue
        (7, 6, 5, 6, "2023-06-01 09:00:00", 1850.00),  # Berlin + Mercedes-Benz
        (8, 1, 6, 5, "2023-09-12 14:00:00", 1320.00)   # Sydney + Ford Escape
    ]
    cursor.executemany("""
    INSERT INTO Booking (user_id, flight_id, hotel_id, car_id, booking_date, total_cost) 
    VALUES (%s, %s, %s, %s, %s, %s)
    """, bookings)

    connection.commit()
    print("Sample data inserted successfully")


# connection.cursor().execute("CREATE DATABASE duplicate_travel_1")
# Main execution
connection = create_connection(db_name="travel_lab_2_dp_5")
# create_tables(connection)
# insert_sample_data(connection)

# connection.close()

Connection to MySQL DB successful

In [3]:
create_tables(connection)

Tables created successfully

In [4]:
insert_sample_data(connection=connection)

Sample data inserted successfully

In [5]:
def view_table_data(connection):
    cursor = connection.cursor()

    # Query to view Users data
    print("\nUsers Table:")
    cursor.execute("SELECT * FROM Users;")
    for row in cursor.fetchall():
        print(row)

    # Query to view Flight data
    print("\nFlight Table:")
    cursor.execute("SELECT * FROM Flight;")
    for row in cursor.fetchall():
        print(row)

    # Query to view Hotel data
    print("\nHotel Table:")
    cursor.execute("SELECT * FROM Hotel;")
    for row in cursor.fetchall():
        print(row)

    # Query to view Car data
    print("\nCar Table:")
    cursor.execute("SELECT * FROM Car;")
    for row in cursor.fetchall():
        print(row)

    # Query to view Booking data
    print("\nBooking Table:")
    cursor.execute("SELECT * FROM Booking;")
    for row in cursor.fetchall():
        print(row)

    # Query to view joined Booking data with related tables
    print("\nJoined Booking Data (Booking + Users + Flight + Hotel + Car):")
    cursor.execute("""
        SELECT 
            b.booking_id,
            u.username,
            f.airline,
            f.destination,
            h.name AS hotel_name,
            c.model AS car_model,
            b.booking_date,
            b.total_cost
        FROM Booking b
        JOIN Users u ON b.user_id = u.user_id
        JOIN Flight f ON b.flight_id = f.flight_id
        JOIN Hotel h ON b.hotel_id = h.hotel_id
        JOIN Car c ON b.car_id = c.car_id;
    """)
    for row in cursor.fetchall():
        print(row)

In [6]:
view_table_data(connection)

Users Table:
(1, 'JohnDoe', 'john@example.com', 'password123', '1234567890')
(2, 'JaneSmith', 'jane@example.com', 'password456', '0987654321')
(3, 'AliceJohnson', 'alice@example.com', 'password789', '1122334455')
(4, 'BobBrown', 'bob@example.com', 'password987', '2233445566')
(5, 'ChrisWhite', 'chris@example.com', 'password654', '3344556677')
(6, 'DianaGreen', 'diana@example.com', 'password321', '4455667788')
(7, 'EveBlue', 'eve@example.com', 'passwordabc', '5566778899')
(8, 'FrankYellow', 'frank@example.com', 'passworddef', '6677889900')
(9, 'GracePink', 'grace@example.com', 'passwordghi', '7788990011')
(10, 'HankBlack', 'hank@example.com', 'passwordjkl', '8899001122')

Flight Table:
(1, 'Airline A', 'New York', datetime.datetime(2024, 12, 1, 8, 0), datetime.datetime(2024, 12, 1, 14, 0), Decimal('500.00'))
(2, 'Airline B', 'London', datetime.datetime(2024, 12, 5, 10, 0), datetime.datetime(2024, 12, 5, 16, 0), Decimal('750.00'))
(3, 'Airline C', 'Paris', datetime.datetime(2023, 5, 20, 9, 0), datetime.datetime(2023, 5, 20, 13, 0), Decimal('600.00'))
(4, 'Airline D', 'Tokyo', datetime.datetime(2023, 9, 12, 14, 0), datetime.datetime(2023, 9, 12, 22, 0), Decimal('800.00'))
(5, 'Airline E', 'Sydney', datetime.datetime(2022, 3, 10, 7, 0), datetime.datetime(2022, 3, 10, 19, 0), Decimal('1200.00'))
(6, 'Airline F', 'Berlin', datetime.datetime(2022, 7, 1, 12, 0), datetime.datetime(2022, 7, 1, 17, 0), Decimal('900.00'))

Hotel Table:
(1, 'Hotel Plaza', 'New York', 10, Decimal('200.00'))
(2, 'Grand Hotel', 'London', 5, Decimal('300.00'))
(3, 'Hilton Paris', 'Paris', 20, Decimal('250.00'))
(4, 'Tokyo Inn', 'Tokyo', 15, Decimal('220.00'))
(5, 'Sydney Lodge', 'Sydney', 7, Decimal('350.00'))
(6, 'Berlin Suites', 'Berlin', 12, Decimal('400.00'))

Car Table:
(1, 'AB1234', 'Toyota Corolla', 'Sedan', 'New York', Decimal('50.00'))
(2, 'AB1233', 'BMW X5', 'SUV', 'London', Decimal('100.00'))
(3, 'AB1232', 'Audi A3', 'Sedan', 'Paris', Decimal('70.00'))
(4, 'AB1231', 'Nissan Rogue', 'SUV', 'Tokyo', Decimal('80.00'))
(5, 'AB1230', 'Ford Escape', 'SUV', 'Sydney', Decimal('90.00'))
(6, 'AB1229', 'Mercedes-Benz C-Class', 'Sedan', 'Berlin', Decimal('120.00'))

Booking Table:
(1, 1, 5, 5, 5, datetime.datetime(2022, 3, 10, 7, 0), Decimal('1550.00'))
(2, 2, 6, 6, 6, datetime.datetime(2022, 7, 1, 12, 0), Decimal('1300.00'))
(3, 3, 3, 1, 1, datetime.datetime(2022, 4, 10, 9, 0), Decimal('980.00'))
(4, 4, 4, 2, 2, datetime.datetime(2022, 6, 18, 12, 0), Decimal('1100.00'))
(5, 5, 1, 3, 3, datetime.datetime(2022, 8, 25, 10, 0), Decimal('890.00'))
(6, 6, 2, 4, 4, datetime.datetime(2022, 11, 10, 15, 0), Decimal('980.00'))
(7, 7, 3, 1, 1, datetime.datetime(2023, 5, 20, 9, 0), Decimal('920.00'))
(8, 8, 4, 2, 2, datetime.datetime(2023, 8, 15, 12, 0), Decimal('1150.00'))
(9, 9, 5, 3, 3, datetime.datetime(2023, 4, 18, 10, 0), Decimal('990.00'))
(10, 10, 6, 4, 4, datetime.datetime(2023, 12, 20, 15, 0), Decimal('1420.00'))
(11, 7, 6, 5, 6, datetime.datetime(2023, 6, 1, 9, 0), Decimal('1850.00'))
(12, 8, 1, 6, 5, datetime.datetime(2023, 9, 12, 14, 0), Decimal('1320.00'))

Joined Booking Data (Booking + Users + Flight + Hotel + Car):
(5, 'ChrisWhite', 'Airline A', 'New York', 'Hilton Paris', 'Audi A3', datetime.datetime(2022, 8, 25, 10, 0), Decimal('890.00'))
(12, 'FrankYellow', 'Airline A', 'New York', 'Berlin Suites', 'Ford Escape', datetime.datetime(2023, 9, 12, 14, 0), Decimal('1320.00'))
(6, 'DianaGreen', 'Airline B', 'London', 'Tokyo Inn', 'Nissan Rogue', datetime.datetime(2022, 11, 10, 15, 0), Decimal('980.00'))
(3, 'AliceJohnson', 'Airline C', 'Paris', 'Hotel Plaza', 'Toyota Corolla', datetime.datetime(2022, 4, 10, 9, 0), Decimal('980.00'))
(7, 'EveBlue', 'Airline C', 'Paris', 'Hotel Plaza', 'Toyota Corolla', datetime.datetime(2023, 5, 20, 9, 0), Decimal('920.00'))
(4, 'BobBrown', 'Airline D', 'Tokyo', 'Grand Hotel', 'BMW X5', datetime.datetime(2022, 6, 18, 12, 0), Decimal('1100.00'))
(8, 'FrankYellow', 'Airline D', 'Tokyo', 'Grand Hotel', 'BMW X5', datetime.datetime(2023, 8, 15, 12, 0), Decimal('1150.00'))
(1, 'JohnDoe', 'Airline E', 'Sydney', 'Sydney Lodge', 'Ford Escape', datetime.datetime(2022, 3, 10, 7, 0), Decimal('1550.00'))
(9, 'GracePink', 'Airline E', 'Sydney', 'Hilton Paris', 'Audi A3', datetime.datetime(2023, 4, 18, 10, 0), Decimal('990.00'))
(2, 'JaneSmith', 'Airline F', 'Berlin', 'Berlin Suites', 'Mercedes-Benz C-Class', datetime.datetime(2022, 7, 1, 12, 0), Decimal('1300.00'))
(10, 'HankBlack', 'Airline F', 'Berlin', 'Tokyo Inn', 'Nissan Rogue', datetime.datetime(2023, 12, 20, 15, 0), Decimal('1420.00'))
(11, 'EveBlue', 'Airline F', 'Berlin', 'Sydney Lodge', 'Mercedes-Benz C-Class', datetime.datetime(2023, 6, 1, 9, 0), Decimal('1850.00'))

#### Extract a list of all `<car_number, type>` that had bookings in all months of 2023.

In [19]:
# C code
! /home/gjyotin305/Desktop/DE-Assign-1/cscripts/testMySqlAPI 0

Query executed in 0.000060 seconds
AB1234 Sedan
AB1233 SUV
AB1232 Sedan
AB1231 SUV
AB1230 SUV
AB1229 Sedan

In [20]:
start = time.time()
cursor = connection.cursor()

query = """
SELECT C.car_number, C.type
FROM Booking B
JOIN Car C ON B.car_id = C.car_id
WHERE YEAR(B.booking_date) = 2023;
"""

cursor.execute(query)
cars_all_months = cursor.fetchall()
end = time.time()

print(f"Query Executed in {end-start}")

Query Executed in 0.0024504661560058594

In [8]:
cars_all_months

[('AB1234', 'Sedan'),
 ('AB1233', 'SUV'),
 ('AB1232', 'Sedan'),
 ('AB1231', 'SUV'),
 ('AB1230', 'SUV'),
 ('AB1229', 'Sedan')]

#### From the above list, print the names of all car_numbers who were associated with a flight booking.

In [17]:
# C code
! /home/gjyotin305/Desktop/DE-Assign-1/cscripts/testMySqlAPI 1

Query executed in 0.000060 seconds
AB1234 Sedan
AB1233 SUV
AB1232 Sedan
AB1231 SUV
AB1230 SUV
AB1229 Sedan

In [9]:
start = time.time()
cursor = connection.cursor()

query = """
SELECT C.car_number, C.type
FROM Booking B
JOIN Car C ON B.car_id = C.car_id
WHERE YEAR(B.booking_date) = 2023 AND B.flight_id IS NOT NULL;
"""

cursor.execute(query)
result = cursor.fetchall()
end = time.time()

print(f"Query Executed in {end-start}")

In [10]:
result

[('AB1234', 'Sedan'),
 ('AB1233', 'SUV'),
 ('AB1232', 'Sedan'),
 ('AB1231', 'SUV'),
 ('AB1230', 'SUV'),
 ('AB1229', 'Sedan')]

#### Print a list of all guests who have made a booking of ‘single_room’ + ‘innova’ in 2022, From the above list, derive a list of the guest_name and their profile information.

In [16]:
# C code
! /home/gjyotin305/Desktop/DE-Assign-1/cscripts/testMySqlAPI 2

Query executed in 0.000075 seconds
AliceJohnson 1122334455 alice@example.com

In [11]:
start = time.time()
cursor = connection.cursor()

query = """
SELECT u.username, u.contact_info, u.email
FROM Users u
JOIN Booking b ON u.user_id = b.user_id
JOIN Hotel h ON b.hotel_id = h.hotel_id
JOIN Car c ON b.car_id = c.car_id
WHERE h.name = 'Hotel Plaza' AND c.model = 'Toyota Corolla'
AND YEAR(b.booking_date) = 2022
"""

cursor.execute(query)
result = cursor.fetchall()
end = time.time()

print(f"Query Executed in {end-start}")

In [12]:
result

[('AliceJohnson', '1122334455', 'alice@example.com')]

#### Derive a list of all <guest_profiles> who have not made any bookings.

In [13]:
start = time.time()
cursor = connection.cursor()

query = """
SELECT u.username, u.email
FROM Users u
LEFT JOIN Booking b ON u.user_id = b.user_id
WHERE b.user_id IS NULL;
"""

cursor.execute(query)
result = cursor.fetchall()
end = time.time()

print(f"Query Executed in {end-start}")

In [14]:
result

[]